In [1]:
import pandas as pd

## Sereis

In [2]:
data = [1,2,3,4,5]

In [4]:
s = pd.Series(data)

In [5]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
index = ['linhas' + str(i) for i in range(5)]

In [7]:
index

['linhas0', 'linhas1', 'linhas2', 'linhas3', 'linhas4']

In [8]:
s = pd.Series(data = data, index = index)

In [9]:
s

linhas0    1
linhas1    2
linhas2    3
linhas3    4
linhas4    5
dtype: int64

In [10]:
data = {'Linha' + str(i): i+1 for i in range(5)}

In [11]:
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [12]:
s = pd.Series(data)

In [13]:
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [14]:
s1 = s + 2

In [15]:
s1

Linha0    3
Linha1    4
Linha2    5
Linha3    6
Linha4    7
dtype: int64

In [16]:
s2 = s + s1

In [17]:
s2

Linha0     4
Linha1     6
Linha2     8
Linha3    10
Linha4    12
dtype: int64

## Dataframe

In [20]:
data =[[1,2,3],[4,5,6],[7,8,9]]

In [21]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [22]:
df1 = pd.DataFrame(data=data)

In [23]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [24]:
index = ['Linha' + str(i) for i in range(3)]

In [25]:
index

['Linha0', 'Linha1', 'Linha2']

In [26]:
df1 = pd.DataFrame(data=data, index=index)

In [27]:
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [28]:
columns = ['Colunas' + str(i) for i in range(3)]

In [29]:
columns

['Colunas0', 'Colunas1', 'Colunas2']

In [30]:
df1 = pd.DataFrame(data=data, index=index, columns=columns)

In [31]:
df1

        Colunas0  Colunas1  Colunas2
Linha0         1         2         3
Linha1         4         5         6
Linha2         7         8         9

In [46]:
data =  {'Colunas0':{'Linha0':1, 'Linha1':2, 'Linha2':3},
        'Colunas1':{'Linha0':2, 'Linha1':5, 'Linha2':6},
        'Colunas2':{'Linha0': 3, 'Linha1': 6, 'Linha2': 9}
        }

In [49]:
data

{'Colunas0': {'Linha0': 1, 'Linha1': 2, 'Linha2': 3},
 'Colunas1': {'Linha0': 2, 'Linha1': 5, 'Linha2': 6},
 'Colunas2': {'Linha0': 3, 'Linha1': 6, 'Linha2': 9}}

In [50]:
df2 = pd.DataFrame(data)

In [51]:
df2

        Colunas0  Colunas1  Colunas2
Linha0         1         2         3
Linha1         2         5         6
Linha2         3         6         9

In [52]:
data =[(1,2,3),(4,5,6),(7,8,9)]

In [53]:
df3 = pd.DataFrame(data=data, index=index, columns=columns)

In [54]:
df3

        Colunas0  Colunas1  Colunas2
Linha0         1         2         3
Linha1         4         5         6
Linha2         7         8         9

In [55]:
df1[df1 > 0] = 'A'
df1

       Colunas0 Colunas1 Colunas2
Linha0        A        A        A
Linha1        A        A        A
Linha2        A        A        A

In [56]:
df2[df2 > 0] = 'B'
df2

       Colunas0 Colunas1 Colunas2
Linha0        B        B        B
Linha1        B        B        B
Linha2        B        B        B

In [57]:
df3[df3 > 0] = 'C'
df3

       Colunas0 Colunas1 Colunas2
Linha0        C        C        C
Linha1        C        C        C
Linha2        C        C        C

In [58]:
df4 = pd.concat([df1, df2,df3])
df4

       Colunas0 Colunas1 Colunas2
Linha0        A        A        A
Linha1        A        A        A
Linha2        A        A        A
Linha0        B        B        B
Linha1        B        B        B
Linha2        B        B        B
Linha0        C        C        C
Linha1        C        C        C
Linha2        C        C        C

In [60]:
df4 = pd.concat([df1, df2,df3], axis = 1 )
df4

,Colunas0,Colunas1,Colunas2,Colunas0,Colunas1,Colunas2,Colunas0,Colunas1,Colunas2
Linha0,A,A,A,B,B,B,C,C,C
Linha1,A,A,A,B,B,B,C,C,C
Linha2,A,A,A,B,B,B,C,C,C

In [64]:
dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df
df

   A  B
X  1  2
Y  3  4